 	IDENTIFICATION DIVISION.
	PROGRAM-ID. BOR09.
	AUTHOR. EROKOM.   
      ***************************************************
      *  BORPUA.DAT DIZISINI YARATMA                    *
      *                                                 *
      *  FIRMA : BINDALLI                               *
      *  TARIH : 18/07/1986                             *
      ***************************************************
	ENVIRONMENT DIVISION.
	CONFIGURATION SECTION.
	SOURCE-COMPUTER. TIPC.
	OBJECT-COMPUTER. TIPC.
	INPUT-OUTPUT SECTION.
	FILE-CONTROL.
		SELECT BORPUA ASSIGN TO RANDOM "BORPUA.DAT"
			ORGANIZATION IS INDEXED
			ACCESS IS RANDOM
			RECORD KEY IS PUSICIL
		ALTERNATE RECORD KEY PUDEPKOD WITH DUPLICATES.
	DATA DIVISION.
	FILE SECTION.
		COPY "BORPUA.COP".
	WORKING-STORAGE SECTION.
	77	CEV     PIC X(1) VALUE SPACES.
	PROCEDURE DIVISION.
	BASLA.
		DISPLAY SPACE ERASE.
		DISPLAY "BINDALLI/METMAK" LINE 1 POSITION 1 REVERSE.
		DISPLAY "BORPUA.DAT PERSONEL PUANTAJ DOSYASI SILIP ACMA"
			LINE 3 POSITION 1.
		DISPLAY "=================================================="
			LINE 4 POSITION 1.
		DISPLAY "          ISI KESMEK ICIN [1]" 
			LINE 6 POSITION 1.
		DISPLAY "DIZIYI YENIDEN ACMAK ICIN [2]"
			LINE 8 POSITION 1.
		DISPLAY "                    GIRIN [ ]"
			LINE 10 POSITION 1.
	AL.
		ACCEPT CEV LINE 10 POSITION 28 TAB.
		IF CEV = "1" GO TO KAPAT.
		IF CEV = "2" NEXT SENTENCE ELSE GO TO AL.
		DISPLAY "ICERDEKI MASTER SILINIYOR [E/H]?"
			LINE 12 POSITION 1. 
		ACCEPT CEV LINE 12 POSITION 35 TAB.
		IF CEV NOT = "E" GO TO KAPAT.
		OPEN OUTPUT BORPUA.
		DISPLAY "BORPUA.DAT DOSYASI ACILDI"
			LINE 14 POSITION 1 REVERSE.
		CLOSE BORPUA.
	KAPAT.
		DISPLAY SPACE ERASE.
		STOP RUN.
