	IDENTIFICATION DIVISION.
	PROGRAM-ID. MUH22.
	AUTHOR. EROKOM AS.
**************************************************************
***********   GUNLUK MUHASEBE KAYITLARI DEGISIKLIK ***********
***********   FISNO YA GORE                        ***********
***********   SIRKET KODU   : 1                    ***********
***********   HESAP NO TIPI : 2/1/2/3               ***********
***********   FIRMA         : BINDALLI/METMAK      ***********
***********   TARIH         : 21/11/1985           ***********
**************************************************************
	ENVIRONMENT DIVISION.	
	CONFIGURATION SECTION.
	SOURCE-COMPUTER. NCR-PC.
	OBJECT-COMPUTER. NCR-PC.
	INPUT-OUTPUT SECTION.
	FILE-CONTROL.
		SELECT MUHGUN ASSIGN TO RANDOM "MUHGUN.DAT"
			ORGANIZATION IS INDEXED
			ACCESS MODE IS DYNAMIC
			RECORD KEY IS HYUKNO
			ALTERNATE RECORD KEY HFISKEY WITH DUPLICATES
			ALTERNATE RECORD KEY HFISNO  WITH DUPLICATES.
		SELECT CHRIND ASSIGN TO RANDOM "CHRIND.DAT"
			ORGANIZATION IS INDEXED 
			ACCESS RANDOM
			RECORD KEY IS ANAHTAR.
	DATA DIVISION.
	FILE SECTION.
		COPY "MUHGUN.COP".
	FD	CHRIND LABEL RECORDS STANDARD.
	01	CHRKAY.
		02 ANAHTAR		PIC X(10).
		02 ALAN OCCURS 24 TIMES PIC X(80).
	WORKING-STORAGE SECTION.
	77	ZFISNO		PIC Z(5).
	77	KOD		PIC 9(3).
	77	CEV             PIC X(1)  VALUE SPACES.
	77	ATL             PIC 9(9)V99 VALUE ZEROES.
	77	BTL             PIC 9(9)V99 VALUE ZEROES.
	77	WBTL		PIC 9(9)V99 VALUE ZERO.
	77	WATL		PIC 9(9)V99 VALUE ZERO.
	77	BORC            PIC 9(9)V99 VALUE ZEROES.
	77	ALAC            PIC 9(9)V99 VALUE ZEROES.
	77	SAY             PIC 9(2)  VALUE ZERO.
	77	K		PIC 9(2) VALUE 0.
	77 	SWDEV           PIC 9(1)  VALUE ZERO.
	77	SIL		PIC X VALUE SPACES.
	77 	ZTL             PIC ZZZ,ZZZ,ZZZ.ZZ.
	77	WDA		PIC X VALUE SPACES.
	77	SWC		PIC X(1) VALUE SPACE.
	77	WIZH		PIC X(35).
	77	SWT		PIC 9 VALUE 0.
	77	WSIRKET		PIC X(1) VALUE SPACES.
	77	WSIRAD		PIC X(12) VALUE SPACES.
	77      I               PIC 9(2)  VALUE ZERO.
	77      ESKI            PIC X(5).
	77      YENI            PIC X(5).
	77      J               PIC 9(2)  VALUE ZERO.
	77	TFISNO		PIC X(5).
	77	SWILK		PIC 9(1)  VALUE 0.
	77	PP		PIC 9(2).
	01	AFISNO		PIC 9(5).
	01 	WFISNO REDEFINES AFISNO PIC X(5).
	01	TAR.
		02 TGUN		PIC X(2).
		02 TAY          PIC X(2).
		02 TYIL         PIC X(2).
	PROCEDURE DIVISION.
	BASLA.
		OPEN I-O MUHGUN INPUT CHRIND.
		DISPLAY SPACE ERASE.
		MOVE "MUHSEK1   " TO ANAHTAR.
		READ CHRIND INVALID KEY
			DISPLAY SPACE ERASE
			DISPLAY "** MUHSEK1 KAYDI CHRIND'DE YOK KAPADI"
				LINE 10 POSITION 1 BLINK
			ACCEPT CEV LINE 11 POSITION 1
			GO TO KAPAT.
	AA.
	   	DISPLAY SPACE ERASE.
		DISPLAY "GUNLUK MUHASEBE HAREKETLERI DUZELTME"
			LINE 1 POSITION 25.
		DISPLAY "------------------------------------"
			LINE 2 POSITION 25.
		DISPLAY "ISI KESMEK ICIN [ F1 ] TUSUNA BASINIZ"
			LINE 24 POSITION 25.
		DISPLAY "GORMEK ISTEDIGIN FIS NO :"
			LINE 8 POSITION 25.
		ACCEPT AFISNO  LINE 8 POSITION 50 CONVERT ECHO TAB 
		ON EXCEPTION KOD GO TO AA1.
	AA1.  	IF KOD = 01 GO TO KAPAT.
		MOVE AFISNO TO ZFISNO.
		DISPLAY ZFISNO LINE 8 POSITION 50.
		DISPLAY "BINDALLI A.S.               [ 1 ]"
			LINE 12 POSITION 25.
		DISPLAY "METMAK A.S.                 [ 2 ]"
			LINE 13 POSITION 25.
		DISPLAY "           FIRMA KODU GIRIN [   ]"
			LINE 15 POSITION 25.
	ALA.	ACCEPT WSIRKET LINE 15 POSITION 55 TAB.
		IF WSIRKET < "1" OR WSIRKET > "3" GO TO ALA. 						
		MOVE ZERO TO BORC ALAC.
		MOVE WFISNO TO ESKI HFISNO.
	OK.
	   	READ MUHGUN KEY IS HFISNO  INVALID KEY
			DISPLAY "** BU FIS NO DA KAYIT YOK **"
				LINE 10 POSITION 50 BLINK
			ACCEPT CEV LINE 10 POSITION 49
			GO TO AA.
		MOVE HYUKNO TO YENI.
		IF HSIRKET NOT = WSIRKET 
		MOVE 1 TO SWILK GO TO OK1.
		MOVE 0 TO SWILK.
	BB.
	   	PERFORM BASLIK THRU BASCIK.
		MOVE 0 TO SWDEV.
		MOVE HFISNO TO ZFISNO.
		DISPLAY ZFISNO LINE 2 POSITION 69.
		MOVE HGUN TO TGUN.
		MOVE HAY TO TAY.
		MOVE HYIL TO TYIL.
		MOVE HFISNO TO TFISNO WFISNO.
		DISPLAY TGUN LINE 1 POSITION 69.
		DISPLAY TAY LINE 1 POSITION 72.
		DISPLAY TYIL LINE 1 POSITION 77.
		MOVE 6 TO I.
	CC.
	   	DISPLAY HHESNO1 LINE I POSITION 2.
		MOVE HIZH TO WIZH.
		DISPLAY WIZH LINE I POSITION 11.
		MOVE ZERO TO ATL BTL.
		IF HBA = "B" MOVE HTL TO ZTL BTL
			     DISPLAY ZTL LINE I POSITION 47
                             ADD HTL TO BORC
			     DISPLAY SPACES LINE I POSITION 64 SIZE 14
			     ELSE
			     MOVE HTL TO ZTL ATL
			     DISPLAY ZTL LINE I POSITION 64
			     ADD HTL TO ALAC
			     DISPLAY SPACES LINE I POSITION 47 SIZE 14.
	CC1.	
		MOVE BORC TO ZTL.
		DISPLAY ZTL LINE 22 POSITION 47.
		MOVE ALAC TO ZTL.
		DISPLAY ZTL LINE 22 POSITION 64.
	OK1.
		READ MUHGUN NEXT AT END GO TO DDT.
		IF ESKI NOT = HFISNO  GO TO DDT.
		IF HSIRKET NOT = WSIRKET GO TO OK1.
		IF SWILK = 1 MOVE HYUKNO TO YENI
			MOVE 0 TO SWILK GO TO BB. 
		IF I = 20 GO TO DD.
		ADD 1 TO I.
		GO TO CC.
	DD.
		MOVE 1 TO SWDEV.
	DDT.
	    	MOVE ESKI TO HFISNO.
	OK2.
		READ MUHGUN KEY IS HFISNO INVALID KEY GO TO HATA.
		IF HSIRKET NOT = WSIRKET GO TO DDC.
	DDL.
	    	IF HYUKNO = YENI GO TO DDK.
	DDC.
		READ MUHGUN NEXT AT END GO TO AA.
		IF HSIRKET NOT = WSIRKET GO TO DDC.
		GO TO DDL.
	DDK.
		PERFORM BASVARMI THRU BASVARCIK.
		IF SIL = "E" GO TO FISSIL.
		IF CEV = "E" NEXT SENTENCE ELSE GO TO DD0.
		PERFORM BASAL THRU BASALCIK.
		REWRITE HARKAY INVALID KEY GO TO HATA.
	DD0.
		MOVE 6 TO K.
	DD1.	
		MOVE ZERO TO ATL BTL.
		IF HBA = "B" MOVE HTL TO BTL
				ELSE
				MOVE HTL TO ATL.
		PERFORM VARMI THRU VARCIK.
		IF CEV = "D" GO TO DEGISTIR.              
		IF CEV = "S" GO TO SILME.
		GO TO DD2.
	DEGISTIR.
		PERFORM DETAYAL THRU DETCIK.
	   	MOVE TFISNO TO HFISNO.
		MOVE TGUN TO HGUN.
		MOVE TAY TO HAY.
		MOVE TYIL TO HYIL.
		REWRITE HARKAY INVALID KEY GO TO HATA.
	DD2.
		IF K = 20 GO TO DSON.
		ADD 1 TO K.
	DDJ.		READ MUHGUN NEXT AT END GO TO AA.
		IF HFISNO NOT = ESKI GO TO AA.
		IF HSIRKET NOT = WSIRKET GO TO DDJ.
		GO TO DD1.
	DSON.
		READ MUHGUN NEXT AT END GO TO AA.
		IF HSIRKET NOT = WSIRKET GO TO DSON.
		IF SWDEV = 1 MOVE HYUKNO TO YENI
			GO TO BB.
		GO TO AA.
	HATA.	
		DISPLAY "** GARIP BIR HATA PROGRAMI KESTI **" 
			LINE 24 POSITION 40 BLINK.
		ACCEPT CEV LINE 24 POSITION 80.
		GO TO AA.
	VARMI.
		MOVE K TO J. SUBTRACT 5 FROM J.
		DISPLAY J LINE 24 POSITION 1.
		DISPLAY ".SATIR DUZELTME [D], SILME [S] ? [ ]"
			LINE 24 POSITION 3.
		MOVE SPACES TO CEV.
		ACCEPT CEV LINE 24 POSITION 37 ON EXCEPTION KOD
		GO TO X1.
	X1.	IF KOD = 01 GO TO AA.
		DISPLAY SPACES LINE 24 POSITION 1 SIZE 80.
	VARCIK. EXIT.
	BASVARMI.
		DISPLAY "BU FIS SILINECEKMI [E/H] ?      [ ]" 
			LINE 24 POSITION 1.
		MOVE SPACES TO SIL.
		ACCEPT SIL LINE 24 POSITION 34 ON EXCEPTION KOD 
			GO TO XX1.
	XX1.	IF KOD = 01 GO TO AA.
		IF SIL = "E" GO TO BASVARCIK.
		DISPLAY "FISNO-TARIH DUZELECEKMI [E/H] ? [ ]"
			LINE 24 POSITION 1.
		MOVE SPACES TO CEV.
		ACCEPT CEV LINE 24 POSITION 34 ON EXCEPTION KOD 
		GO TO X2.
	X2.	IF KOD = 01 GO TO AA.
		DISPLAY SPACES LINE 24 POSITION 1 SIZE 80.
	BASVARCIK. EXIT.
	BASAL.
		MOVE SPACES TO CEV.
	A1.	ACCEPT HGUN LINE 1 POSITION 69  TAB ON EXCEPTION
		KOD GO TO A2.
	A2.	IF KOD = 01 GO TO KAPAT.
		IF HGUN < "01" OR HGUN > "31" GO TO A1.
	A3.	ACCEPT HAY LINE 1 POSITION 72 TAB ON EXCEPTION
		KOD GO TO A4.
	A4.	IF KOD = 01 GO TO KAPAT.
		IF KOD = 14 GO TO A1.
		IF KOD = 17 GO TO A1.
		IF HAY < "01" OR HAY > "12" GO TO A3.
	A5. 	ACCEPT HYIL LINE 1 POSITION 77 TAB ON EXCEPTION
		KOD GO TO A6.
	A6. 	IF KOD = 01 GO TO KAPAT.
		IF KOD = 14 GO TO A3.
		IF KOD = 17 GO TO A1.
		IF TYIL < "83" OR TYIL > "99" GO TO A5.
	A7.	ACCEPT AFISNO LINE 2 POSITION 69 CONVERT ECHO TAB
		ON EXCEPTION KOD GO TO A8.
	A8. 	IF KOD = 01 GO TO KAPAT.
		IF KOD = 14 GO TO A5.
		IF KOD = 17 GO TO A1.
		MOVE AFISNO TO ZFISNO HFISNO TFISNO.
		DISPLAY ZFISNO LINE 2 POSITION 69.
		MOVE HYIL TO TYIL. MOVE HAY TO TAY. MOVE HGUN TO TGUN.
		DISPLAY "FISNO-TARIH YANLISSA [Y] GIR [ ]"
			LINE 24 POSITION 1.
		MOVE SPACES TO CEV.
		ACCEPT CEV LINE 24 POSITION 31 ON EXCEPTION KOD
		GO TO X3.
	X3.	IF KOD = 01 GO TO AA.
		DISPLAY SPACES LINE 24 POSITION 1 SIZE 80.
		IF CEV = "Y" GO TO A1.
	BASALCIK. EXIT.
	DETAYAL. 
		MOVE SPACES TO CEV.
		MOVE WSIRKET TO HSIRKET.
	D1.	ACCEPT HHESNO1 LINE K POSITION 2 TAB ON EXCEPTION
		KOD GO TO D2.
	D2.	IF KOD = 01 GO TO KAPAT.
	D3.	ACCEPT WIZH LINE K POSITION 11 TAB ON EXCEPTION
		KOD GO TO D4.
	D4.	IF KOD = 01 GO TO KAPAT.
		IF KOD = 17 GO TO D1.
		IF KOD = 14 GO TO D1.
		MOVE WIZH TO HIZH.
	D5.	MOVE BTL TO WBTL.
		ACCEPT WBTL LINE K POSITION 47 SIZE 14 CONVERT ECHO TAB
		ON EXCEPTION KOD GO TO D6.
	D6.	IF KOD = 01 GO TO KAPAT.
		IF KOD = 14 DISPLAY SPACES LINE K POSITION 47 SIZE 14
				GO TO D3.
		IF KOD = 17 DISPLAY SPACES LINE K POSITION 47 SIZE 14
				GO TO D1.
		MOVE WBTL TO ZTL.
		DISPLAY ZTL LINE K POSITION 47.
	D7.	MOVE ATL TO WATL.
	   	ACCEPT WATL LINE K POSITION 64 SIZE 14 CONVERT ECHO TAB
		ON EXCEPTION KOD GO TO D8.
	D8.	IF KOD = 01 GO TO KAPAT.
		IF KOD = 14 DISPLAY SPACES LINE K POSITION 64 SIZE 14
				GO TO D5.
		IF KOD = 17 DISPLAY SPACES LINE K POSITION 64 SIZE 14
				GO TO D1.
		MOVE WATL TO ZTL.
		DISPLAY ZTL LINE K POSITION 64.
		IF WBTL NOT = 0 AND WATL NOT = 0
			DISPLAY "HEM BORC HEM ALACAK VAR"
				LINE 24 POSITION 41 BLINK
			ACCEPT CEV LINE 24 POSITION 80
			DISPLAY SPACES LINE 24 POSITION 41 SIZE 40
			GO TO D5.
		IF WBTL = 0 AND WATL = 0
			DISPLAY "BORC ALACAK YOK"
				LINE 24 POSITION 41 BLINK
			ACCEPT CEV LINE 24 POSITION 80
			DISPLAY SPACES LINE 24 POSITION 41 SIZE 40
			GO TO D5.
		DISPLAY "GIRDIGINIZ YANLIS ISE [Y] GIRIN [ ]"
			LINE 24 POSITION 41.
		MOVE SPACES TO CEV.
		ACCEPT CEV LINE 24 POSITION 74 ON EXCEPTION KOD
		GO TO X4.
	X4. 	IF KOD = 01 GO TO AA.
		DISPLAY SPACES LINE 24 POSITION 41 SIZE 40.
		IF CEV = "Y" GO TO D1.
		SUBTRACT BTL FROM BORC.
		SUBTRACT ATL FROM ALAC.
		ADD WBTL TO BORC.
		ADD WATL TO ALAC.
		PERFORM CC1.
		IF WBTL = 0 MOVE "A" TO HBA
			    MOVE WATL TO HTL
			    ELSE
			    MOVE "B" TO HBA
			    MOVE WBTL TO HTL.
	DETCIK.	EXIT.
	SILME.  MOVE SPACES TO CEV.
		DISPLAY "SILIYORUM EMINMISINIZ ? [E/H] ? [ ]"
			LINE 24 POSITION 1.
		MOVE SPACES TO CEV.
		ACCEPT CEV LINE 24 POSITION 34 ON EXCEPTION KOD 
		GO TO X8.
	X8.	IF KOD = 01 GO TO AA.
		DISPLAY SPACES LINE 24 POSITION 1 SIZE 80.
		IF CEV NOT = "E" GO TO DD2.
		DELETE MUHGUN INVALID KEY DISPLAY 
		"SILEMEDIM HATA VAR " LINE 24 POSITION 1
		ACCEPT CEV LINE 24 POSITION 79
		DISPLAY SPACES LINE 24 POSITION 1 SIZE 80 
		GO TO DD2.
		DISPLAY SPACES LINE K POSITION 2 SIZE 8.
		DISPLAY SPACES LINE K POSITION 11 SIZE 35.
		DISPLAY SPACES LINE K POSITION 47 SIZE 14.
		DISPLAY SPACES LINE K POSITION 64 SIZE 14.
		GO TO DD2.
	FISSIL.  
		DISPLAY "SILIYORUM EMINMISINIZ ? [E/H] ?[  ]"
			LINE 24 POSITION 1.
		ACCEPT CEV LINE 24 POSITION 34 ON EXCEPTION KOD 
		GO TO FS1.
	FS1.	IF KOD = 01 GO TO AA.
		DISPLAY SPACES LINE 24 POSITION 1 SIZE 80.	
		IF CEV NOT = "E" GO TO AA.
	FS2.	DELETE MUHGUN INVALID KEY GO TO HATA.
	FS3. 	READ MUHGUN NEXT AT END GO TO AA.
		IF HFISNO NOT = ESKI GO TO AA.
		IF HSIRKET NOT = WSIRKET GO TO FS3.
		GO TO FS2.
	BASLIK.
		MOVE 0 TO I.
	BAS1.
		ADD 1 TO I.
		DISPLAY ALAN (I) LINE I POSITION 1.
		IF WSIRKET = "1" DISPLAY "BINDALLI A.S."
					LINE 1 POSITION 1 REVERSE.
		IF WSIRKET = "2" DISPLAY "METMAK A.S."
					LINE 1 POSITION 1 REVERSE.
		IF I = 24 NEXT SENTENCE ELSE GO TO BAS1.
	BASCIK. EXIT.
	KAPAT.
		CLOSE MUHGUN CHRIND.
		STOP RUN.
