	IDENTIFICATION DIVISION.
	PROGRAM-ID. MUH26.
	AUTHOR. EROKOM AS.
*************************************************************
********  MUHGUN DEKI GUNLUK HAREKETLERI HESPLN YE ISLEME ***
********  SIRKET        : 1                               ***
********  HESAP NO TIPI : 2/1/2/3                         ***
********  FIRMA         : YUKSEL KAHVE                    ***
********  TARIH         : 21/11/1985                      ***
*************************************************************
     	ENVIRONMENT DIVISION.
	CONFIGURATION SECTION.
	SOURCE-COMPUTER. NCR-PC.
	OBJECT-COMPUTER. INCRPC.
	SPECIAL-NAMES. DECIMAL-POINT IS COMMA.
	INPUT-OUTPUT SECTION.
	FILE-CONTROL.
		SELECT HESPLN ASSIGN TO RANDOM "HESPLN.DAT"
			ORGANIZATION IS INDEXED ACCESS IS RANDOM
			RECORD KEY IS HESNO.
		SELECT MUHGUN ASSIGN TO RANDOM "MUHGUN.DAT"
			ORGANIZATION IS INDEXED
			ACCESS MODE IS SEQUENTIAL
			RECORD KEY IS HYUKNO
		    ALTERNATE RECORD KEY IS HFISKEY WITH DUPLICATES
		    ALTERNATE RECORD KEY IS HFISNO  WITH DUPLICATES.
	DATA DIVISION.
	FILE SECTION.
		COPY "HESPLN.COP".
		COPY "MUHGUN.COP".
	WORKING-STORAGE SECTION.
	77	SWSON	PIC 9 VALUE ZERO.
	77	ESKI		PIC X(8) VALUE SPACES.
	77	CEV  		PIC X(1) VALUE SPACES.
	77	OKUSAY		PIC 9(5) VALUE ZERO.
	77	YAZSAY		PIC 9(5) VALUE ZERO.
	77	GOS		PIC Z(5).
	77	WBORC		PIC 9(11)V99 VALUE ZERO.
	77	WALAC		PIC 9(11)V99 VALUE ZERO.
	77	ZTL		PIC ZZ.ZZZ.ZZZ.ZZZ,ZZ.
	PROCEDURE DIVISION.
	BASLA.
		OPEN INPUT MUHGUN I-O HESPLN.
		DISPLAY SPACES ERASE.
		DISPLAY "BINDALLI" LINE 1 POSITION 1 REVERSE.
		DISPLAY "GUNLUK MUHASEBE KAYITLARINI HESPLN'A ISLEME"
			LINE 2 POSITION 25.
		DISPLAY "-------------------------------------------"
			LINE 3 POSITION 25.
		DISPLAY "ISE BASLAMAK ICIN [ B ] GIRIN ? [   ]"
			LINE 5 POSITION 25.
		ACCEPT CEV LINE 5 POSITION 59 TAB.
		DISPLAY SPACES LINE 5 POSITION 1 SIZE 80.
		IF CEV NOT = "B" GO TO KAPAT.
		DISPLAY " OKUNAN MUHASEBE KAYDI :" LINE 5 POSITION 25.
		DISPLAY "YAZILAN HES.PLAN KAYDI :" LINE 7 POSITION 25.
	OKU.
		READ MUHGUN WITH NO LOCK AT END GO TO SON.
		MOVE HHESNO TO HESNO.
		READ HESPLN INVALID KEY
			DISPLAY HHESNO LINE 15 POSITION 1
			DISPLAY "** HESAP NO HESPLN'DA YOK KAPADI **"
				LINE 15 POSITION 10
			DISPLAY HYUKNO LINE 16 POSITION 1
			ACCEPT CEV LINE 16 POSITION 1
			GO TO KAPAT.
		ADD 1 TO OKUSAY.
		MOVE OKUSAY TO GOS.
		DISPLAY GOS LINE 5 POSITION 49.
		IF HBA = "A" ADD HTL TO CALAC
			     ADD HTL TO WALAC
			     ADD HTL TO KALAC.
		IF HBA = "B" ADD HTL TO CBORC
			    ADD HTL TO WBORC
			     ADD HTL TO KBORC.
		REWRITE MUHREC INVALID KEY 
			DISPLAY HHESNO LINE 15 POSITION 1
			DISPLAY "** HESNO YU HESPLN'A YAZAMADIM KAPADI"
				LINE 15 POSITION 10
			ACCEPT CEV LINE 16 POSITION 1
			GO TO KAPAT.
		ADD 1 TO YAZSAY.
		MOVE YAZSAY TO GOS.
		DISPLAY GOS LINE 7 POSITION 49.
		GO TO OKU.
	SON.
		DISPLAY "HESPLN'YE ISLEME BITMISTIR ...."
			LINE 15 POSITION 25.
		DISPLAY "ISLENEN HAREKETLER YEKUNU"
			LINE 20 POSITION 25.
		DISPLAY "-------------------------"
			LINE 21 POSITION 25.
		DISPLAY "ALACAK :" LINE 22 POSITION 25.
		DISPLAY "  BORC :" LINE 23 POSITION 25.
		MOVE WALAC TO ZTL.
		DISPLAY ZTL LINE 22 POSITION 33.
		MOVE WBORC TO ZTL.
		DISPLAY ZTL LINE 23 POSITION 33.
		ACCEPT CEV LINE 24 POSITION 25.
	KAPAT.
		CLOSE HESPLN MUHGUN.
		STOP RUN.
