	IDENTIFICATION DIVISION.
	PROGRAM-ID. SNT06.
	AUTHOR.	EROKOM.
      ***********************************************************
      * SENET DEFTERI DOKUMU SENET NO SIRASINDA                 *
      *                                                         *
      * FIRMA:BINDALLI                                          *
      * TARIH:6/1/1986                                          *
      ***********************************************************
        ENVIRONMENT DIVISION.                                    
	CONFIGURATION SECTION.
	SOURCE-COMPUTER. NCR-PC.
	OBJECT-COMPUTER. NCR-PC.
	SPECIAL-NAMES. DECIMAL-POINT IS COMMA.
	INPUT-OUTPUT SECTION.
	FILE-CONTROL.
		SELECT SENMAS ASSIGN TO RANDOM "SENMAS.DAT"
		    ORGANIZATION IS INDEXED
		    ACCESS IS SEQUENTIAL
		    RECORD KEY IS SENETNO
		    ALTERNATE RECORD SENKEY1 WITH DUPLICATES
		    ALTERNATE RECORD SENKEY2 WITH DUPLICATES
		    ALTERNATE RECORD SENKEY3 WITH DUPLICATES.
		SELECT SENMASA ASSIGN TO RANDOM "SENMASA.DAT"
			ORGANIZATION IS INDEXED
			ACCESS IS RANDOM
			RECORD KEY IS ASENETNO
			ALTERNATE RECORD KEY ASENKEY1 WITH DUPLICATES
			ALTERNATE RECORD KEY ASENKEY2 WITH DUPLICATES
			ALTERNATE RECORD KEY ASENKEY3 WITH DUPLICATES.
	DATA DIVISION.
	FILE SECTION.
		COPY "SENMASA.COP".
		COPY "SENMAS.COP".
	WORKING-STORAGE SECTION.
	77	OKUSAY		PIC 9(4) VALUE 0.
	77	YAZSAY		PIC 9(4) VALUE 0.
	PROCEDURE DIVISION.
	BASLA.
		OPEN INPUT SENMAS OUTPUT SENMASA.
	BSL.
		DISPLAY SPACES ERASE.
		DISPLAY "BINDALLI" LINE 1 POSITION 1 HIGH.
		DISPLAY "SENETLERI TASIMA    " LINE 1 POSITION 20 HIGH.
		DISPLAY "====================" LINE 2 POSITION 20 HIGH.
		DISPLAY "OKUNAN KAYIT :" LINE 4 POSITION 20 HIGH.
		MOVE SPACES TO SENKEY3.
		START SENMAS KEY NOT LESS SENKEY3.
		DISPLAY "YAZILAN KAYIT:" LINE 6 POSITION 20 HIGH.
	OKU.
		READ SENMAS WITH NO LOCK AT END GO TO SON.
		ADD 1 TO OKUSAY.
		DISPLAY SENETNO LINE 10 POSITION 10.
		DISPLAY OKUSAY LINE 4 POSITION 40.
		MOVE SENKAY TO ASENKAY.
		WRITE ASENKAY.
		ADD 1 TO YAZSAY.
		DISPLAY YAZSAY LINE 6 POSITION 40.
		GO TO OKU.
	SON.
		CLOSE SENMAS SENMASA.
		STOP RUN.
